src/Конфигурация/Catalogs/СтатьиДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>СтатьиДДС</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтображатьВОтчетеПоРасходам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяПлана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиПлана</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Конфигурация/Catalogs/СтатьиДДС/Ext/ManagerModule.bsl
Процедура ПервоначальноеЗаполнение() Экспорт
	Выборка = Справочники.СтатьиДДС.Выбрать();
	Если Не Выборка.Следующий() Тогда
		Наименования = Новый Массив;
		Наименования.Добавить(НСтр("ru = 'Прочие расходы'; en = 'Other'"));
		Наименования.Добавить(НСтр("ru = 'Корректировка сальдо'; en = 'Balance correction'"));
		
		Для Каждого Наименование Из Наименования Цикл
			Если Не ЗначениеЗаполнено(Справочники.СтатьиДДС.НайтиПоНаименованию(Наименование)) Тогда
				Эл = Справочники.СтатьиДДС.СоздатьЭлемент();
				Эл.Наименование                = Наименование;
				Эл.ОтображатьВОтчетеПоРасходам = Истина;
				Эл.СтатьяПлана                 = Справочники.СтатьиПлана.Прочее;
				Эл.Записать();
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры
